# LowerRange Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProgressChangedEventArgs..::..LowerRange Property
ProgressChangedEventArgs Class See Also
---
Lower part of progress bar range - always zero
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int LowerRange { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LowerRange As Integer
	Get
```

Visual C++
---
```text
public:
property int LowerRange {
	int get ();
}
```

# See Also
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace